In [49]:
%reload_ext sql

In [50]:
%%sql
sqlite:///CourseData2.db

'Connected: @CourseData2.db'

In [51]:
%%sql
SELECT *
FROM import_coursemeetingsF14
LIMIT 10

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[('Fall2014', '70384', 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'F', '2014-09-19T08:00:00', '2014-09-19T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'T', '2014-09-23T08:00:00', '2014-09-23T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'F', '2014-09-26T08:00:00', '2014-09-26T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'T', '2014-09-30T08:00:00', '2014-09-30T09:15:00'),
 ('Fall2014', '70384', 'DSB 105', 'F', '2014-10-03T08:00:00', '2014-10-03T09:15:00')]

In [52]:
%%sql
DROP TABLE IF EXISTS coursemeetings;
CREATE TABLE coursemeetings (
    term TEXT NOT NULL,
    crn INTEGER NOT NULL,
    location TEXT NOT NULL,
    day TEXT NOT NULL,
    start TEXT NOT NULL,
    end TEXT NOT NULL);

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.
Done.

[]

In [53]:
%%sql
select * from coursemeetings
limit 10;

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[]

In [54]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF14

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
31505 rows affected.

[]

In [55]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF15

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
31456 rows affected.

[]

In [56]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(62961,)]

In [57]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF16

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
31474 rows affected.

[]

In [58]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(94435,)]

In [59]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF17

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
31400 rows affected.

[]

In [60]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(125835,)]

In [61]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsF18

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
33440 rows affected.

[]

In [62]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(159275,)]

In [63]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS15

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
29351 rows affected.

[]

In [64]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(188626,)]

In [65]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS16

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
30124 rows affected.

[]

In [66]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(218750,)]

In [67]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS17

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
29738 rows affected.

[]

In [68]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(248488,)]

In [69]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS18

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
29086 rows affected.

[]

In [70]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(277574,)]

In [71]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsS19

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
28348 rows affected.

[]

In [72]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(305922,)]

In [73]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSB17

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
5 rows affected.

[]

In [74]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(305927,)]

In [75]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSU15

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
2584 rows affected.

[]

In [76]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(308511,)]

In [77]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSU16

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
3007 rows affected.

[]

In [78]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(311518,)]

In [79]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSU17

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
2666 rows affected.

[]

In [80]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(314184,)]

In [81]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsSU18

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
2624 rows affected.

[]

In [82]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(316808,)]

In [83]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsW15

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
101 rows affected.

[]

In [84]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(316909,)]

In [85]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsW16

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
106 rows affected.

[]

In [86]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(317015,)]

In [87]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsW17

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
213 rows affected.

[]

In [88]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(317228,)]

In [89]:
%%sql
INSERT INTO coursemeetings (term,crn,location,day,start,end)
SELECT term,crn,location,day,start,end
FROM import_coursemeetingsW18

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
93 rows affected.

[]

In [90]:
%%sql
SELECT COUNT (*)
FROM coursemeetings

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(317321,)]

In [94]:
%%sql
CREATE TABLE courses (
    term TEXT NOT NULL,
    crn INTEGER NOT NULL,
    catalog_id TEXT NOT NULL,
    section TEXT NOT NULL,
    credits FLOAT NOT NULL,
    title TEXT NOT NULL,
    meetings TEXT NOT NULL,
    timecodes TEXT NOT NULL,
    primary_instructor TEXT NOT NULL,
    cap INTEGER NOT NULL,
    act INTEGER NOT NULL,
    rem INTEGER NOT NULL);

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[]

In [95]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF14

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
1522 rows affected.

[]

In [96]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF15

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
1475 rows affected.

[]

In [97]:
%%sql
SELECT COUNT (*)
FROM courses

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(2997,)]

In [98]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF16

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
1491 rows affected.

[]

In [99]:
%%sql
SELECT COUNT (*)
FROM courses

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(4488,)]

In [100]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF17

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
1479 rows affected.

[]

In [101]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesF18

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
1519 rows affected.

[]

In [102]:
%%sql
SELECT COUNT (*)
FROM courses

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(7486,)]

In [103]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS15

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
1421 rows affected.

[]

In [104]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS16

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
1387 rows affected.

[]

In [105]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS17

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
1435 rows affected.

[]

In [106]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS18

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
1405 rows affected.

[]

In [107]:
%%sql
SELECT COUNT (*)
FROM courses

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(13134,)]

In [108]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesS19

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
1473 rows affected.

[]

In [109]:
%%sql
SELECT COUNT (*)
FROM courses

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(14607,)]

In [110]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSB17

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
1 rows affected.

[]

In [111]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU15

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
316 rows affected.

[]

In [112]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU16

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
310 rows affected.

[]

In [113]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU17

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
285 rows affected.

[]

In [114]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesSU18

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
313 rows affected.

[]

In [115]:
%%sql
SELECT COUNT (*)
FROM courses

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(15832,)]

In [116]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW15

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
25 rows affected.

[]

In [117]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW16

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
28 rows affected.

[]

In [118]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW17

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
24 rows affected.

[]

In [119]:
%%sql
INSERT INTO courses (term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem)
SELECT term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
FROM import_coursesW18

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
28 rows affected.

[]

In [120]:
%%sql
SELECT COUNT (*)
FROM courses

   sqlite:///CourseData.db
 * sqlite:///CourseData2.db
Done.

[(15937,)]